app/controllers/admins/omniauth_callbacks_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "hncleary@tamu.edu"], ["LIMIT", 1]]
---
    def google_oauth2
      admin = Admin.from_google(from_google_params)

      if admin.present?
        # sign_out_all_scopes
        # flash[:success] = t 'devise.omniauth_callbacks.success', kind: 'Google'
        # sign_in_and_redirect admin, event: :authentication
        if !User.where(email: admin.email).empty?