app/views/users/index.html.erb

SELECT "attendances".* FROM "attendances" WHERE "attendances"."username" = $1  [["username", "hnpatel97"]]
SELECT "events".* FROM "events"
---
    <% @user = User.find(match[:id]) %>
    <% @attendances = Attendance.where(username: @user.username) %>
    <% @events = Event.all %>

SELECT "positions".* FROM "positions" WHERE "positions"."position_title" = $1 ORDER BY "positions"."id" ASC LIMIT $2  [["position_title", "admin"], ["LIMIT", 1]]
---
                  <td><%= event.date.strftime('%b %e, %Y') %></td>
                  <td><%= event.point_amount * Position.where(position_title: @user.position_id).first.multiplier %></td>