app/views/users/index.html.erb

SELECT "admins".* FROM "admins" WHERE "admins"."id" = $1  [["id", 1]]
---

<% @current_user = Admin.where(id: 1) %>

SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "phillipwong95@tamu.edu"]]
---

  <% @userList = User.where(:email => user.email) %>