app/views/attendance/show.html.erb

            <td><%= event.date.strftime('%b %e, %Y') %></td>
            <td><%= event.point_amount * Position.where(position_title: @user.position_id).first.multiplier %></td>
---
SELECT "positions".* FROM "positions" WHERE "positions"."position_title" = $1 ORDER BY "positions"."id" ASC LIMIT $2  [["position_title", "member"], ["LIMIT", 1]]