app/controllers/attendance_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "attendances".* FROM "attendances" WHERE "attendances"."username" = $1  [["username", "derrickg"]]
SELECT "events".* FROM "events"
---
  def show
    @user = User.find(params[:id])
    @attendances = Attendance.where(username: @user.username)
    @events = Event.all