app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "position_id", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", ""], ["last_name", ""], ["position_id", ""], ["username", ""], ["created_at", "2020-10-08 20:17:26.673070"], ["updated_at", "2020-10-08 20:17:26.673070"]]
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "member_points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["member_points", 9], ["updated_at", "2020-10-05 14:44:02.159437"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)

SELECT "users".* FROM "users"
SELECT "events".* FROM "events"
SELECT "attendances".* FROM "attendances" WHERE "attendances"."username" = $1  [["username", "derrickg"]]
SELECT COUNT(*) FROM "attendances" WHERE "attendances"."username" = $1  [["username", "derrickg"]]
SELECT "positions".* FROM "positions" WHERE "positions"."position_title" = $1 ORDER BY "positions"."id" ASC LIMIT $2  [["position_title", "member"], ["LIMIT", 1]]
UPDATE "users" SET "member_points" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["member_points", 6], ["updated_at", "2020-10-07 01:28:50.289323"], ["id", 2]]
---
  def update_points
    User.all.each do |user|
      @username = user.username
      @position_id = user.position_id
      @events = Event.all
      @attendances = Attendance.where(username: @username)
      @total_attendance = @attendances.count
      @multiplier = Position.where(position_title: @position_id).first.multiplier
      @total_points = 0
      @attendances.each do |attendance|
        @events.each do |event|
          @total_points += (event.point_amount * @multiplier) if event.event_name.match?(attendance.event_id)
        end
      end
      user.update_attributes(member_points: @total_points)