app/models/admin.rb

SELECT "users".* FROM "users"
INSERT INTO "admins" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "admins".* FROM "admins" WHERE "admins"."email" = $1 LIMIT $2  [["email", "hncleary@tamu.edu"], ["LIMIT", 1]]
---
  def self.from_google(email:, full_name:, uid:, avatar_url:)

    userExists = false
    @users = User.all
    @users.each do |user|
      if user.email == email
        userExists = true
        break
      end
      if userExists = false
        return nil
      end
    end

    return nil unless email =~ /@tamu.edu\z/
    create_with(uid: uid, full_name: full_name, avatar_url: avatar_url).find_or_create_by!(email: email)