app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."email" = $1  [["email", "phillipwong95@tamu.edu"]]
---
      <ul>
        <% match = User.where(:email => current_admin.email)[0] %>